In [2]:
import pandas as pd

In [3]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2010_1102/01303.htm')

In [4]:
df = df[2]

In [5]:
df.shape

(162, 10)

In [6]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9
0,NaN,NaN,"Adkins (NP) 735,799","Nahmias (NP) 1,007,828","Wilson (NP) 346,537","Totals 2,090,164",NaN,NaN,NaN,NaN
1,NaN,NaN,35.2%,48.2%,16.6%,100.0%,NaN,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,APPLING,100%,1621,1831,668,4120,NaN,NaN,NaN,NaN
4,ATKINSON,100%,434,442,221,1097,NaN,NaN,NaN,NaN

In [7]:
df = df[3:]

In [8]:
df.head(5)

          0     1     2     3     4     5   6   7   8   9
3   APPLING  100%  1621  1831   668  4120 NaN NaN NaN NaN
4  ATKINSON  100%   434   442   221  1097 NaN NaN NaN NaN
5     BACON  100%   735   837   285  1857 NaN NaN NaN NaN
6     BAKER  100%   368   446   143   957 NaN NaN NaN NaN
7   BALDWIN  100%  2921  4996  1515  9432 NaN NaN NaN NaN

In [9]:
df = df[df.columns[[0,2,3,4]]]

In [10]:
df.head(5)

          0     2     3     4
3   APPLING  1621  1831   668
4  ATKINSON   434   442   221
5     BACON   735   837   285
6     BAKER   368   446   143
7   BALDWIN  2921  4996  1515

In [11]:
df.columns = ['county', 'Tammy Lynn Adkins', 'David Nahmias', 'Matt Wilson']

In [12]:
df.tail(5)

        county Tammy Lynn Adkins David Nahmias Matt Wilson
157  WHITFIELD              4962          5763        2364
158     WILCOX               605           731         405
159     WILKES               883          1415         440
160  WILKINSON               898          1347         419
161      WORTH              1826          2034        1108

In [13]:
df = df.melt(id_vars=['county'])

In [14]:
df.columns = ['county', 'candidate', 'votes']

In [15]:
df.head()

     county          candidate votes
0   APPLING  Tammy Lynn Adkins  1621
1  ATKINSON  Tammy Lynn Adkins   434
2     BACON  Tammy Lynn Adkins   735
3     BAKER  Tammy Lynn Adkins   368
4   BALDWIN  Tammy Lynn Adkins  2921

In [16]:
df['votes'] = df['votes'].astype(int)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 477 entries, 0 to 476
Data columns (total 3 columns):
county       477 non-null object
candidate    477 non-null object
votes        477 non-null int64
dtypes: int64(1), object(2)
memory usage: 11.3+ KB

In [18]:
df['office'] = 'Supreme Court Justice'

In [19]:
df['district'] = ''

In [20]:
df['party'] = 'Non-Partisan'
# df['party'] = 'Democrat'
# df['party'] = 'Republican'
# df.loc[df['candidate'] == 'Greg Winters', 'party'] = 'Republican'

In [21]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
David Nahmias      Non-Partisan    1007828
Matt Wilson        Non-Partisan     346537
Tammy Lynn Adkins  Non-Partisan     735799
Name: votes, dtype: int64

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

,county,office,district,party,candidate,votes
0,APPLING,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,1621
1,ATKINSON,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,434
2,BACON,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,735
3,BAKER,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,368
4,BALDWIN,Supreme Court Justice,,Non-Partisan,Tammy Lynn Adkins,2921

In [23]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')